Tekla Open API Reference for Tekla Structures 2025
OkApplyModifyGetOnOffCancel.OnOffClicked Event
 The OnOffClicked event is raised when the On-Off button is clicked.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event EventHandler OnOffClicked
Public Event OnOffClicked As EventHandler
Value
Type: System.EventHandler
See Also
Reference
OkApplyModifyGetOnOffCancel Class
Tekla.Structures.Dialog.UIControls Namespace